---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.PolesNumber
source: html/14cb243d-47cf-dc12-d15d-78234f42e66a.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.PolesNumber Property

The Poles Number of the Electrical System.

## Syntax (C#)
```csharp
public int PolesNumber { get; }
```

## Remarks
This property is used to retrieve the Poles Number of the Electrical System.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This property only available when System Type is Power!